In [2]:
import mysql.connector
conn=mysql.connector.connect(host='localhost',user='root',password='',
                            database='company')
cur=conn.cursor()

In [3]:
import pandas as pd
data=pd.read_sql('select * from emp', conn) #read from database
data

C:\Users\pvashishtha\Anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   eid    ename  dept     sal
0   90  Prateek    30  220000
1   92  Deepali    10  130000
2   93    Kiran    10   90000
3   94    Kiran    10   90000

In [ ]:
import mysql.connector
class Student:
    def __init__(self):
        self.conn=mysql.connector.connect(host='localhost',user='root',password='',
                            database='company')
        self.cur=conn.cursor()
        return None
    def insert(self, item, total, sold, left):
        sql='insert into items values({0},{1},{2},{3})'.format(item, total, sold, left)
        self.cur.execute(sql)
        return cur.rowcount